In [1]:
import pandas as pd

In [8]:
air_quality=pd.read_csv(r"D:\Github\Pandas\usingdatasets\air_quality_no2.csv",index_col=0,parse_dates=True)

In [9]:
air_quality.head()

                     station_antwerp  station_paris  station_london
datetime
2019-05-07 02:00:00              NaN            NaN            23.0
2019-05-07 03:00:00             50.5           25.0            19.0
2019-05-07 04:00:00             45.0           27.7            19.0
2019-05-07 05:00:00              NaN           50.4            16.0
2019-05-07 06:00:00              NaN           61.9             NaN

In [10]:
air_quality["london_mg_per_cubic"]=air_quality['station_london']*1.882

In [11]:
air_quality.head()

,station_antwerp,station_paris,station_london,london_mg_per_cubic
datetime,,,,
2019-05-07 02:00:00,NaN,NaN,23.0,43.286
2019-05-07 03:00:00,50.5,25.0,19.0,35.758
2019-05-07 04:00:00,45.0,27.7,19.0,35.758
2019-05-07 05:00:00,NaN,50.4,16.0,30.112
2019-05-07 06:00:00,NaN,61.9,NaN,NaN

In [12]:
air_quality['ratio_paris_antwerp']=(air_quality["station_paris"]/air_quality["station_antwerp"])
air_quality.head(1)

,station_antwerp,station_paris,station_london,london_mg_per_cubic,ratio_paris_antwerp
datetime,,,,,
2019-05-07 02:00:00,NaN,NaN,23.0,43.286,NaN

In [15]:
air_quality_renamed=air_quality.rename(
    columns={
        "station_antwerp":"Jaipur", 
        "station_paris":'Dausa',
        "ratio_paris_antwerp":"ratio_Dausa_Jaipur"
    }
)
air_quality_renamed.head(1)

,Jaipur,Dausa,station_london,london_mg_per_cubic,ratio_Dausa_Jaipur
datetime,,,,,
2019-05-07 02:00:00,NaN,NaN,23.0,43.286,NaN